import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/framework.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

import '../cubits/chat_cubit/chat_cubit.dart';
import '../models/message.dart';
import '../widgets/chat_buble.dart';
import 'constants.dart';

class ChatPage extends StatelessWidget {
  List<Message> messagesList = [];
//بعمل سترنج اسمه ايدي علشان لما اعمل بوش ونافيجاشن عليها ا
//بخليها ستاتك علشان اقدر اوصللها عن طريق الكلاس مش عن طريق اوبجيكت من الكلاس
  //طبعا مش لازم انسى اني اروح على صفحه المين و اضيف الروت تاع الشات بيج
  static String id = "ChatPage";
  //هاد الاوبجيكت تاعي عشان اقدر اتعامل مع الفاييربيس وهو من الخطوات الي بمشي فيهم المكتوبه في الدوكيومنتاشن لاقدر اتعامل مع الفايربيس لا
  //هسا الهطوه الي بعدها هي التعامل مع الكوليكشن والدوكيومينت فهو هسا بدي انشئ ريفيرينس على الماسيج الي عملتلها كوليكشن ا
  //فانا بنشئ ريفيرينس عن طريق اني اعمل اوبجيكت نوعه ريفيرنس وبعدها من خلال الفاييربيس ااكسس الكوليكشن هاي وطبعا هاد الشي موجود بالخطوات الي بمشي علسها في الدوكيومنتاشن ا
  // Create a CollectionReference called users that references the firestore collection
  //بين الاقواس هناك بروح بكتب اسم الكوليكشن الي عندي اسم الكوليكشن هةون الي بدي اياه هو الماسيجيس فبكتب اسمه ا
  //طبعا هاد الاسم في الكوليكشن انا انشئته في الداتابيس في الفايربيس ا
  //لازم اسم الكوليكشن اكتبها صح ميه بالميه لو حرف غلط بروح ينشألي كوليكشن جديد بنفس الاسم الغلط وهاد الشي حيسببلي اغلاط و مشاكل كتير لهيك الاحسن اروخ انسأه ك كونستنس عنا و نستدعيه من هون
  //بس هسا حطيت عليه كومينت لانه كله حطيته في الكيوبيت ا

  // CollectionReference messages =
  //     FirebaseFirestore.instance.collection(KMessagesCollections);

  //هسا علشان احذف الداتا لما ابعت الرساله يعني ما تضل بالتيكست بستخدم اشي اسمه كونترولر
//نوع الكونترولر دايما هيك تيكست ايديتنج
  TextEditingController controller = TextEditingController();

  //how to make listview scroll to end in flutter
  //هسا انا علشان لما افتح المحادثه اخر شي يكون ظاهر هي اخر محادثه يعني مش اول رسائل بعتناها
  //فهو بروح على جوجل بسأله كيف اخلي السكرول في الليست فيو يكون اخر شي فهسا اول شي من الاجوبه عرفو كونترولر وخلوها تساوي سكرول كونترولر يعني هي بتشتغل مع اشي فيه سكرول ا
  final _controller = ScrollController();
  @override
  Widget build(BuildContext context) {
    //هسا علشان استقبل البيانات الي جاييتني من الارجيومينت مثلا الارجيومينت الي كتبتها في اللوج ان علشان اخد الايميل عشان اذا عندي امتر من يورز اميز بينهم انه كل واحد اله ايميل مميز فيه/ هيك بكتب جوا البيلد
//هيك بقدر اوصل لللارجيومينت عن طريق كلاس اسمه موديل راوت وبعدها بستخدم الميثود الي اسمها اوف كونتكس بعدها بقله اعطيني السيتنج و جوا السيتنج بقله اعطيني الاراجيومينت  ا
//طبعا بخزنها في متغير نوعه حسب الشي الي راجعلي لو مشعارف ايش راجعلي فهو بخزنه بمتعير نوعه فار / انا هون متاكد انه سترنج فبحط كمان ااز سترينج ا
    var email = ModalRoute.of(context)!.settings.arguments;
    //لهيك بروج على كل شاشه منهم من الريجيستر واللوج ان وبحكي لما يصير نجاح يفوته على هاي الصفحه
    //لكن هسا بقله يرجعلي كويري يناب شوت بدل دوكيومينت سناب شوت لان الكويري هي فيها مجموعه الدوكيومينت الي انا بحتاجها يعني بقدر فيها اوصل لاي رساله بدي اياها هديك كنت بس للدوكيومينت الي كاتب الايدي تاعها ا
    //return FutureBuilder<DocumentSnapshot>(
    //اذن الكويري سنتب شوت هي الاشي الي فيه كل الدوكيومينت ا
    //return FutureBuilder<QuerySnapshot>(
    //الفرق بين الفيوشر بيلدر والستريم بيلدر: الفيوشر بيلدر بتبني ال يو اي بناء على داتا جايه من المستقبل/ أما الستريم بيلدر بتبني ال يو اي عده مرات بناء على ال يو الي جايه من المستقبل يعني بيعرضلي اللاشياء لايف اول بأول يعني مقلا هون بعتت رساله على طول حتبين بالمحادثه لما ارسلها اما الفيوشر لازم اعمل ري ستارت للبرنامج واعاده تشغيل لحتى تبين الرساله الي بعتتها   ا
    //return StreamBuilder<QuerySnapshot>(
    //طبعا غيرت هون من جيت الى سناب شوت لان الجيت بترجعلي فيوشر يعني اشي واحد في المستقبل لكن انا لو بدي اشي يرجع كل شويه كل ما يصير تغيير ترجع ففي هاي الحاله لازم استخدم اشي بيجيب الستريم مش الفيوشر لهيك بهاي الحاله بنرجع للسناب شوت/ السناب شوت بترجعلي ستريم من السناب شوت  ا
    //الاوردر باي علشان ارتب الرسائل عندي يعني انا هون بدي رتب الرسائل حسب الوقت ا
    //طبعا عشان اقله يرتب حسب الوقت فهو بقله تحت انه هو مش راح يضيف بس الماسيج هو راح يضيف كمان الكرييات ديت ا
    //خطوه 3 علشان اخر رساله بعتتها تكون تخت فبروح اعكس الديسينج وبخليها ترو ا
    //وبرضو هون الستريم حطيت عليه كومينت لانه موجود جوا الكيوبيت ا
    //stream: messages.orderBy(kCreatedAt, descending: true).snapshots(),

    //هسا انا شاشه الشات بروح عليها بحالتين الحاله الاولى لما اعمل لوج ان والحاله التانيه لما اعمل ريجيستر
    //فهسا راح استخدم الريكويست الي حكالي عنه الي هو الماسيج بعدها بكتب الدوكيونينت وبين الاقواس بكتب الدوكيومينت ايدي ا
    //هسا الدوكيومينت ايدي بروح على الفير ستور وباخد الايدي تاع الماسيج وبحطه هون ا
    //بعدين بحكيله جيت / جيت يعني رجعلي البيانات
    //      future: messages.doc("8y5pKAyvLOLNuOLKqDFz").get(),
    //الي بدون الايدي هاي معناها اعطيني كل الدوكيومينت

    //  future: messages.get(),

    //جوا الفيوشر ريكويست عنا شي اسمه فيوشر وهو عباره عن ريكويست بستخدمه علشان اجيب البيانات الي انا مختاجها ا
    //هون جوا بحط الاتريبيوت تاعتي فبحط البيلدر اول شي لانه هو ريكويرد اتريبيوت ا
    //البيلدر هون هي عباره عن انونومس فنكشن بحط فيها الكونتكس والسناب شوت/السناب شوت هي الحاجه الي بتحتوي البيانات الي انا بحتاجها يعني هي مش البيانات ذات نفسيها  ا
//       builder: (context, snapshot) {
// //هسا هون جوا البيلدر بأكسس البيانات الي راجعالي عن طريق السناب شوت ا

//         //لما افتح الكيرلي بركيتس بحط ري تيرن للويدجت الي انا مهتم ابنيها بعد ما البيانات تيجي والي عنا هون هي السكافولد ا
// //لازم قبل ما ابني ال يو اي اتأكد انه البيانات موجوده لهيك بحط كلشي هون جوا السكافولد جوا حمله اف ا
//         //بحكيله في جمله ال اف انه يشوف الداتا الي جوا السناب شوت يشوف االداتا هل فيها داتا ولا لا
//         //لو فيها بيانات يعمل ري تيرن للسكافولد والبيانات الي جواه ا
//         if (snapshot.hasData) {
//           //البيانات الي بترجعلنا هون هي عباره عن ليست واليست هاي جواها ماب والماب هاي تمثل الجيسون داتا الي نحنا مهتمين فيها  ا
//           //  print(snapshot.data!.docs[0]['message']);
//           List<Message> messagesList = [];
// //هون بحط فور لانه عندي ليست اوف دوكيومينت فعلشان اعدي وامشي على كل الدوكومينت بخزنه على هيئه ماسيج دوكومينت عندي  ا
//           for (int i = 0; i < snapshot.data!.docs.length; i++) {
// //كل مره بمر على دوكومينت بقله بدي اخزن الدوكومينت عندي في الماسيج ليست تاعتي الي عملتها فوق  ا
//             //لكن هسا لما اقله خزنلي دوكومينت فهو بقله خزنلي اياها على هيئه ماسج موديل ا
//             messagesList.add(Message.fromJson(snapshot.data!.docs[i]));
//           }

    return Scaffold(
      appBar: AppBar(
        //لما اعمل لصفحه بش تلقائي براس الصفحه بصير في سهم انه نرجع للصفحه الي قبلها لانه متل ما حكينا البش بحطلنا كل الصفحات فوق بعض ا
//اذا بدي الغي هاد السهم فهو بستهدم الاتوماتيك ليدنج وبخليها تساوي فولس يعني ما يظهر هاد السهم اني ارجع للصفحه الي قبلها
        automaticallyImplyLeading: false,
        backgroundColor: kPrimaryColor,
        title: Row(
          mainAxisAlignment: MainAxisAlignment.center,
          //بعمل هيك في التايتل اذا بدي احط اللوجو جنب التايتل
          children: [
            //طبعا حطيت اللوجو في كلاس الكونستنس علشان ما اضل كل مره ارجع احط الباث تاعه كل ما بدي اياه لانه اشي بيستخدمه
            Image.asset(
              kLogo,
              height: 50,
            ),
            Text('Chat'),
          ],
        ),
        //السينتر تايتل هاي بستخدمها اذا بدي اخلي التايتل بالنص ا
        centerTitle: true,
      ),
      //هون علشان اعمل شكل الشات متل ما بدي
      //طبعا هاي ويدجت الشات هي ويدحت  بتضل تتكرر لهيك بروح اعملها وبستدعيها كل ما احتاجها بدل ما ارجع اكتبها من جديد طبعا انا حاطها في كلاس الويدجت
      //بحطه جوا ليست فيو بيلدر لانها شات بكون عندي عدد كبير من الرسائل

      //حطيت كولوم لانه عندي ليست فيو  و تحت التيكست تاع الشات الي بكتب فيه الرساله فالكولوم هي الشي الوحيد الي بيسملحلي اني احطهم تحت بعض وبكون الليست فيو سكرول والتيكست يضل ثابت مكانه
      //يعني لما احط اكستند كاني بقلها خدي المساحه المتاحه لكي ا
      body: Column(
        children: [
          //ما بيزبط احط ليست فيو جوا كولوم لان الكولوم هو بياخد مساحه الشاشه اما الليست فيو هو عير محدد بياخد مستحه لحد ما ينتهي فعسان احل المشكله بدي اخليه ياخد مساحه الكولوم فبحطه جوا اكستند
          //انا هون بعمل مانيج لليست فيو فقط لا غير/ يعني البلوك بيلدر تاعي بينحط هون فقط عند اليست فيو بيلدر فقط لا غير  ا
          //هسا انا بقدر احط الكود في البيلدر في البلوك بيلدر لكن الاحسن اذا في كود نكتبه في الليسينر لهيك هون الاحسن استخدم البلوك كونسيومر ا
          Expanded(
            child: BlocConsumer<ChatCubit, ChatState>(
              listener: (context, state) {
                if (state is ChatSuccess) {
                  messagesList = state.messages;
                }
              },
              builder: (context, state) {
                return ListView.builder(
                    //الريفيرس هاي بستخدمها علشان اعكس الليست فيو يعني البدايه تثير النهايه والنهايه البدايه ط
                    //طبعا هاي اول خطوه من الخطوات الي بعملها علشان احل مشكله لما افتح من2 ايميولاتر عندي مشكله انه الرساله ما بتبين اخر شي الا الرساله الي ببعتها يعني اذا بدي ابعت رساله من ايميولاتر لاميولاتر تاني ما بتبين الرساله اخر شي الا لاعمل تحديث لهيك اول شي بعمل ريفيرس هون ا
                    reverse: true,
                    //بعدين هون بنعطي الكونترولر للسيت فيو هون ا
                    controller: _controller,
                    //هسا بدي اعرض البيانات الي جوا الليست في ال يو اي الي انا عرضته ا
                    //فأذن هون بعطيها طول الليست الي انا عاملها ا
                    //وبعد هيك ببني الشات ببل كل مره تاخد الماسج الي راجعالي ا
                    //الماسيجيس ليست هي مجموعه الرسائل الي بيخزن فيها الداتا / انا فوق بعرفها مبدأيا الليست الي من الرسائل الي راح استخدمهم ا
                    itemCount: messagesList.length,
                    itemBuilder: (context, index) {
                      //هون بنحكي يتأكد في البدايه من الايميل لو كان بيساوي الايميل الي معايا اذن هو اليوزر تاع التطبيق واذا كان مش نفسه بخليه يساوي الشات ببل التانيه  ا
                      return messagesList[index].id == email
                          ? chatBubble(
                              message: messagesList[index],
                            )
                          : chatBubbleForFriend(message: messagesList[index]);
                    });
              },
            ),
          ),

          Padding(
            padding: const EdgeInsets.all(16.0),
            child: TextField(
              //هسا علشان احذف الداتا لما ابعت الرساله يعني ما تضل بالتيكست بستخدم اشي اسمه كونترولر
              //طبعا الكونترولر عرفته فوق
              //وهيني تخت كتبت انه هو الي يتحكم بمسح النص
              controller: controller,
              //هون بستهدم الاون سبمت عشان لما لما يكتب الكلمه كامله او يعني الماسيج كامل يبع الماسيج ما يبعتها بعد كل حرف ا
              //يعني لما يصغط ارسال يرسل الماسيج ويبعتها لهيك الاون سبمت استخدمناها ا
              onSubmitted: (data) {
                //هسا هون بكتب ايش ينفذ لما يكبس على الزر ارسال الماسج
                //طبعا باخد من الدوكيمومنتاشن الي بتبع معها
                //ماسيج دوت اد يعني بضيف البيانات الي بدي ابعتهم ا
                //طبعا هون الفاليو بتنضاف على هيئه ماب
                //    messages.add({
                //انا عندي لما انشأت حطيت في الماسج كي وحده الي هي ماسج
                //فبكتب اسمها اول شي بعدين بكتب هي من وين راح تاخد الداتا تاعتها الي هي هون راح تاخد الداتا تاعتها من السب ميت ا
                //       kMessage: data,
                //بجيب الوقت الي تم ارسال الرساله فيه عن طريق كلاس اسمه ديت تايم ا
                //دوت ناو يعني بقله اعطيني الوقت الحالي فهو هيك ببيخزن وقت كل رساله بيبعتها ا
                //         kCreatedAt: DateTime.now(),
                //هون بزيد فيلد زياده الي هو الايدي هاد حطيته علشان يكون لكل مستخدم ايدي خاص فيه وهو يكون عباره عن الايميل علشان شكل الرساله تكون تختلف ما بين المرسل و المستقبل ا
                //          "id": email
                //        });
                controller.clear();

                //هسا هون بعد مايبعت الماسج بكتب انه يتحرك لاخر شي
                //انيميت تو : يعني يتحرك ل ا
                //في اشي تاني اسمه جمب تو هو بكون فيها باول رساله لما اكتبها بنط نطه لاخر رساله اما الانيمات فهو بيتحرك بيشكل سلس لاخر رساله الوقت الي بحدد انه يتحرك فيها للاخر بحدده في الديوراشن مثلا كتبت ثانيه يعني تحركي بثانيه وحده لاخر رساله كون عندها ا
                //اما الكيرف هو الشكل الي حيتحرك فيه من البدايه للنهايه ممكن نطات يعني وممكن اشي تاني وهيك ا
                _controller.animateTo(
                  0,
                  //هاي معناها انه بجيب اقصى شي في الليست فيو ا
                  //هو انا من خلاال هاد الكونترولر بقدر اتحكم بكتير اشياء في الليست فيو ومنها البوزيشن فأنا هون من خلال موقعها بقله جيبلي اخر شي بالموقع تاعها ا
                  //هاي قمتها حطيتها صفر يعني يروج لبدايه الليست فيو طبعا عملت هيك لانه عملت الريفيرس ترو لانه صار عندي مشكله لما اشغل 2ايميولاتر ا//هاي خطوه2
                  //  لكن هسا حتى مع هاي الخطوه السكرول صح بكون موجود تحت لكن اخر رساله بعتتها بتكون اول رساله فقو وهاي حلها ب خطوه 3 ا
                  //  _controller.position.maxScrollExtent,
                  duration: Duration(seconds: 1),
                  curve: Curves.easeIn,
                );
              },
              decoration: InputDecoration(
                hintText: "send message",
                suffixIcon: Icon(
                  Icons.send,
                  color: kPrimaryColor,
                ),
                //ملاحظه مهمه جدا جدا جدا عنا 3 انواع من البوردر اول شي الاينابل بوردر وهو البوردر في حالته قبل ما اضغط عليه وهو هاد بعمله شكل خاص فيه اذا بدي
                //النوع التاني هو الفوكس وهو لما اضغط عليه
                //النوع التالت هو البودر العادي وهو بيشمل الحالتين يعني لما احطله ديكوراشن هو بيكون بيشمل الانابل و الفوكس
                //فيعني لو بدي شي حدد وكل شي مختلف عن التاني بساخدم الاينابل والفوكس
                border:
                    OutlineInputBorder(borderRadius: BorderRadius.circular(16)),
                enabledBorder: OutlineInputBorder(
                    borderRadius: BorderRadius.circular(15),
                    borderSide: BorderSide(color: kPrimaryColor)),
              ),
            ),
          ),
        ],
      ),
    );
  }
  //وهون لو ما في داتا يعمل عادي ري نيرن لاي شي ا
  // else {
  //   return Text("Loading...");
  // }
}
//     );
//   }
// }
//الفيوشر بيلدر تستخدم علشان ابني يو اي بناء على داتا جايه من المستقبل ا
//يعني انا عندي ريكويست بدي ابني اليو اي بناء على الداتا الي جايه من هاد الريكويست
//جوا الفيوشر بيلدر بحدد نوع البيانات الي راجعه ا
//هسا جوا البيلدر عندي انوناميس فنكشن بيعطيني فيها شغلتين اول شغله هي الكونتيكست والشغله التانيه هي اسينك سنابشوت نوعها دوكيومينت سناب شوت هي نفسها الداتا الي في الفيوشر بيلدر بس بقله هون انها اسينك يعني بقله هيه داتا جاييتلي من المستقبل/ الداتا الي بحددها هون هي نفسها الداتا الي انا محددها في الفيوشر بيلدر ا
//هون كمان في البيلدر عامل اوبجيكت اسمه سناب شوت ليستقبل فيه البيانات  ا
//*******************************************************************
//هسا بدي اعمل تيست للتطبيق عندي على 2ايميولاتر مختلفيين لانه ممكن بعض المشاكل فقط تظهر لما اعمل تيست من مكانين ا */
//عشان اعمل تيست على 2 ايميولاتر بكتب في التيرمنل /فلاتر-رن-بعدها داش دي- بعدها ااال
//all
// اflutter run -d all
